read_verilog /content/code.v
prep -flatten
write_json output.json
